Fuentes/ficohsacore-hncard-488b7ad93302/SBHN_Card/SBHN_Card_GetStatusTicket/Resources/GetStatusTicket.wsdl

<wsdl:definitions name="GetStatusTicket" targetNamespace="https://www.ficohsa.com/regional/card" xmlns:tns="https://www.ficohsa.com/regional/card" xmlns:inp1="https://www.ficohsa.com/regional/card" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
    <wsdl:types>
        <xsd:schema>
            <xsd:import namespace="https://www.ficohsa.com/regional/card" schemaLocation="../Schemas/GetStatusTicketTypes.xsd"/>
        </xsd:schema>
    </wsdl:types>
    <wsdl:message name="requestMessage">
        <wsdl:part name="getStatusTicket" element="tns:getStatusTicket"/>
    </wsdl:message>
    <wsdl:message name="replyMessage">
        <wsdl:part name="getStatusTicketResponse" element="tns:getStatusTicketResponse"/>
    </wsdl:message>
    <wsdl:portType name="getStatusTicketPtt">
        <wsdl:operation name="getStatusTicket">
            <wsdl:input message="tns:requestMessage"/>
            <wsdl:output message="tns:replyMessage"/>
        </wsdl:operation>
    </wsdl:portType>
    <wsdl:binding name="getStatusTicketBind" type="tns:getStatusTicketPtt">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="getStatusTicket">
            <soap:operation style="document" soapAction="getStatusTicket"/>
            <wsdl:input>
                <soap:body use="literal" namespace="https://www.ficohsa.com/regional/card"/>
            </wsdl:input>
            <wsdl:output>
                <soap:body use="literal" namespace="https://www.ficohsa.com/regional/card"/>
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>
</wsdl:definitions>